<<<<<<< HEAD
<?php

function greek_to_greeklish($string) {
    return strtr($string, array(
        'Α' => 'A', 
        'Β' => 'V', 
        'Γ' => 'G', 
        'Δ' => 'D', 
        'Ε' => 'E', 
        'Ζ' => 'Z', 
        'Η' => 'I', 
        'Θ' => 'TH', 
        'Ι' => 'I', 
        'Κ' => 'K', 
        'Λ' => 'L', 
        'Μ' => 'M', 
        'Ν' => 'N', 
        'Ξ' => 'KS', 
        'Ο' => 'O', 
        'Π' => 'P', 
        'Ρ' => 'R', 
        'Σ' => 'S', 
        'Τ' => 'T', 
        'Υ' => 'Y', 
        'Φ' => 'F', 
        'Χ' => 'X', 
        'Ψ' => 'PS', 
        'Ω' => 'O',
        'Ά' => 'A', 
        'Έ' => 'E', 
        'Ή' => 'I', 
        'Ί' => 'I', 
        'Ό' => 'O', 
        'Ύ' => 'Y', 
        'Ώ' => 'O', 
        'ου' => 'ou',
        'ού' => 'ou',
        'ευ' => 'ef',
        'εύ' => 'ef',
        'α' => 'a', 
        'β' => 'v', 
        'γ' => 'g', 
        'δ' => 'd', 
        'ε' => 'e', 
        'ζ' => 'z', 
        'η' => 'i', 
        'θ' => 'th', 
        'ι' => 'i', 
        'κ' => 'k', 
        'λ' => 'l', 
        'μ' => 'm', 
        'ν' => 'n', 
        'ξ' => 'ks', 
        'ο' => 'o', 
        'π' => 'p', 
        'ρ' => 'r', 
        'σ' => 's', 
        'τ' => 't', 
        'υ' => 'y', 
        'φ' => 'f', 
        'χ' => 'x', 
        'ψ' => 'ps', 
        'ω' => 'o', 
        'ς' => 's', 
        'ά' => 'a', 
        'έ' => 'e', 
        'ή' => 'i', 
        'ί' => 'i', 
        'ό' => 'o', 
        'ύ' => 'y', 
        'ώ' => 'o', 
        'ϊ' => 'i', 
        'ϋ' => 'y', 
        'ΐ' => 'i', 
        'ΰ' => 'y'));
}

echo greek_to_greeklish('<strong>Όστις σκάπτει λάκκον.</strong><p>Η προκήρυξη (υπερ)πρόωρων εκλογών, που είναι θέμα ωρών ή ημερών, φανερώνει το αδιέξοδο&nbsp; στο οποίο έχει περιέλθει ο πρωθυπουργός. Είναι πρωτοφανές στην μεταπολιτευτική πολιτική ιστορία πρωθυπουργός που έχει κερδίσει δύο απανωτές εκλογικές αναμετρήσεις (βουλευτικές εκλογές 25ης Ιανουαρίου και δημοψήφισμα 5ης Ιουλίου 2015) να αισθάνεται τόσο αδύναμος, ώστε να σέρνει τη χώρα σε τρίτη.</p>
<p>Και αυτό συμβαίνει διότι ο Αλέξης Τσίπας <strong>κακοποίησε και τις δύο λαϊκές εντολές</strong> που πήρε, σε βαθμό που δεν το έκανε κανένας πρωθυπουργός μέχρι τώρα:</p>
<p>- Στις εκλογές του Ιανουαρίου εξελέγη με έναν πακτωλό υποσχέσεων και απατηλών εξαγγελιών, τις οποίες αναγκάστηκε να &laquo;ξεχάσει&raquo; μόλις ήρθε σε επαφή με την πραγματικότητα της διακυβέρνησης. Δεν άκουσε τις πολλές προειδοποιήσεις, ακόμη και ορισμένων στελεχών του ΣΥΡΙΖΑ, να είναι φειδωλός σε τέτοια παλαιοκομματικά τερτίπια. Συμπεριφέρθηκε με ανευθυνότητα προεκλογικά και στο τέλος του εξαμήνου προσγειώθηκε ανώμαλα, προκαλώντας <strong>μεγάλη ζημιά στην οικονομία</strong>.</p>
<p>- Στο δημοψήφισμα του Ιουλίου συνέβη η μεγαλύτερη<strong> διαστροφή</strong> εκλογικού αποτελέσματος στην πρόσφατη πολιτική ιστορία. Ο κ. Τσίπρας ζήτησε και πήρε ένα ηχηρό ΟΧΙ (στη λιτότητα κτλ) και εν μια νυκτί το έκανε ΝΑΙ, υπογράφοντας μια συμφωνία, την οποία θα μπορούσε να έχει υπογράψει από τις 20 Φεβρουαρίου, αποφεύγοντας τις καταστροφικές συνέπειες του επόμενου πενταμήνου.</p>
<p>Έτσι, στις 13 Ιουλίου,μετά την υπογραφή του δικού του Μνημονίου, ο κ. Τσίπρας βρέθηκε μπροστά σε <strong>πολλαπλά αδιέξοδα.</strong></p>
<p><strong>Έχασε </strong>κάθε ηθικό πλεονέκτημα, που διατηρούσε ως τότε, συμπεριφερόμενος ως πολιτικάντης παλαιάς κοπής.. Έκανε ακριβώς ό,τι έκαναν οι προηγούμενοι, τους οποίους κατακεραύνωνε επί πέντε χρόνια.</p>
<p><strong>Έχασε </strong>την κοινοβουλευτική πλειοψηφία και, χωρίς τη στήριξη της αντιπολίτευσης, την οποία λοιδορεί ξεδιάντροπα, θα είχε οδηγήσει τη χώρα στα βράχια.</p>
<p><strong>Έχασε </strong>το μισό κόμμα του φυσιολογικά, καθώς εμφανίστηκε να το κοροϊδεύει κι αυτό. Έτσι, όσο κι αν προκαλούν σύγκρυο οι θέσεις των αριστεροπλατφορμιστών για επιστροφή στη δραχμή, δεν είναι αυτοί που έκαναν την κωλοτούμπα. Μέχρι χτες έλεγαν όλοι τα ίδια. Ο κ. Τσίπρας είχε υπουργούς τον Λαφαζάνη και τον Στρατούλη και επί πέντε μήνες σερνόταν πίσω από τις παραδοξολογίες τους.</p>
<p>Τώρα ο κ. Τσίπρας θα επιδιώξει να απαλλαγεί από το εσωκομματικό του πρόβλημα με εκλογές-εξπρές. Θα επιδιώξει να <strong>υφαρπάξει</strong>, για τρίτη φορά μέσα σε εφτά μήνες, την ψήφο των πολιτών, χωρίς να ξέρουμε τι θέλει να κάνει. Από τη μια έχει αρχίσει να ψηφίζει τα προαπαιτούμενα του νέου <strong>Μνημονίου</strong> με αντιδημοκρατικές και αντικοινοβουλευτικές μεθόδους, που άλλοτε κατακεραύνωνε ο ίδιος. Και από την άλλη <strong>κοκορεύεται</strong> με διάφορες αστείες ανακοινώσεις (<a href="http://news.in.gr/greece/article/?aid=1500019459" target="_blank">εδώ</a> και <a href="http://www.kathimerini.gr/827683/article/oikonomia/ellhnikh-oikonomia/an-h-fraport-8elei-epanadiapragmateysh-8a-einai-synolikh" target="_blank">εδώ</a>), μπας και συγκρατήσει το τμήμα εκείνο του αριστερού εκλογικού σώματος που τώρα θα <strong>λακίσει</strong> και μπορεί να του στερήσει την εξουσία.</p>
<p>Ο κ. Τσίπρας είναι ένας αδύναμος πρωθυπουργός, που δεν ξέρει τι θέλει και γι&rsquo; αυτό οδηγείται από αδιέξοδο σε αδιέξοδο. Για την ακρίβεια, το μόνο που θέλει είναι να υφαρπάξει ξανά τη λαϊκή ψήφο, πριν αρχίσουν να φαίνονται τα ολέθρια αποτελέσματα της εξάμηνης δικής του πολιτικής. Η <strong>εξουσιολαγνεία</strong>, η δική του και της ομάδας που τον περιβάλλει, είναι ορατή δια γυμνού οφθαλμού.</p>
<p>Οι εκλογές θα είχαν κάποιο νόημα αν ο κ. Τσίπρας έλεγε καθαρά <strong>τι θέλει να κάνει</strong>. Να εφαρμόσει το Μνημόνιό του ή να σταματήσει τις εργασίες στις Σκουριές και να ακυρώσει την ιδιωτικοποίηση των περιφερειακών αεροδρομίων, που η κυβέρνησή του ψήφισε; Με ποιους θα συγκυβερνήσει αν το εκλογικό σώμα συνεχίσει να θέλει κυβερνήσεις συνεργασίας; Τα ερωτήματα είναι κρίσιμα, για να προσπαθήσουμε να συλλάβουμε πώς θα κινηθεί η χώρα τα επόμενα χρόνια.</p>
<p>Ο κ. Τσίπρας μέχρι τώρα έστησε δύο <strong>φάκες</strong>: στις 25 Ιανουαρίου και στις 5 Ιουλίου. Και στις δύο ένα μεγάλο μέρος του εκλογικού σώματος τσίμπησε και παγιδεύτηκε: συνειδητά, από άγνοια ή από αφέλεια. <strong>Η τρίτη παγίδα </strong>είναι αυτή που θα στήσει τώρα με τις νέες εκλογές-εξπρές. Ας έχει κατά νου αυτήν την προειδοποίηση της Γραφής: <strong>&laquo;Όστις σκάπτει λάκκον θέλει πέσει εις αυτόν και ο λίθος θέλει επιστρέψει εις τον κυλίοντα αυτόν&raquo;.</strong></p>
=======
<?php

function greek_to_greeklish($string) {
    return strtr($string, array(
        'Α' => 'A', 
        'Β' => 'V', 
        'Γ' => 'G', 
        'Δ' => 'D', 
        'Ε' => 'E', 
        'Ζ' => 'Z', 
        'Η' => 'I', 
        'Θ' => 'TH', 
        'Ι' => 'I', 
        'Κ' => 'K', 
        'Λ' => 'L', 
        'Μ' => 'M', 
        'Ν' => 'N', 
        'Ξ' => 'KS', 
        'Ο' => 'O', 
        'Π' => 'P', 
        'Ρ' => 'R', 
        'Σ' => 'S', 
        'Τ' => 'T', 
        'Υ' => 'Y', 
        'Φ' => 'F', 
        'Χ' => 'X', 
        'Ψ' => 'PS', 
        'Ω' => 'O',
        'Ά' => 'A', 
        'Έ' => 'E', 
        'Ή' => 'I', 
        'Ί' => 'I', 
        'Ό' => 'O', 
        'Ύ' => 'Y', 
        'Ώ' => 'O', 
        'ου' => 'ou',
        'ού' => 'ou',
        'ευ' => 'ef',
        'εύ' => 'ef',
        'α' => 'a', 
        'β' => 'v', 
        'γ' => 'g', 
        'δ' => 'd', 
        'ε' => 'e', 
        'ζ' => 'z', 
        'η' => 'i', 
        'θ' => 'th', 
        'ι' => 'i', 
        'κ' => 'k', 
        'λ' => 'l', 
        'μ' => 'm', 
        'ν' => 'n', 
        'ξ' => 'ks', 
        'ο' => 'o', 
        'π' => 'p', 
        'ρ' => 'r', 
        'σ' => 's', 
        'τ' => 't', 
        'υ' => 'y', 
        'φ' => 'f', 
        'χ' => 'x', 
        'ψ' => 'ps', 
        'ω' => 'o', 
        'ς' => 's', 
        'ά' => 'a', 
        'έ' => 'e', 
        'ή' => 'i', 
        'ί' => 'i', 
        'ό' => 'o', 
        'ύ' => 'y', 
        'ώ' => 'o', 
        'ϊ' => 'i', 
        'ϋ' => 'y', 
        'ΐ' => 'i', 
        'ΰ' => 'y'));
}

echo greek_to_greeklish('<strong>Όστις σκάπτει λάκκον.</strong><p>Η προκήρυξη (υπερ)πρόωρων εκλογών, που είναι θέμα ωρών ή ημερών, φανερώνει το αδιέξοδο&nbsp; στο οποίο έχει περιέλθει ο πρωθυπουργός. Είναι πρωτοφανές στην μεταπολιτευτική πολιτική ιστορία πρωθυπουργός που έχει κερδίσει δύο απανωτές εκλογικές αναμετρήσεις (βουλευτικές εκλογές 25ης Ιανουαρίου και δημοψήφισμα 5ης Ιουλίου 2015) να αισθάνεται τόσο αδύναμος, ώστε να σέρνει τη χώρα σε τρίτη.</p>
<p>Και αυτό συμβαίνει διότι ο Αλέξης Τσίπας <strong>κακοποίησε και τις δύο λαϊκές εντολές</strong> που πήρε, σε βαθμό που δεν το έκανε κανένας πρωθυπουργός μέχρι τώρα:</p>
<p>- Στις εκλογές του Ιανουαρίου εξελέγη με έναν πακτωλό υποσχέσεων και απατηλών εξαγγελιών, τις οποίες αναγκάστηκε να &laquo;ξεχάσει&raquo; μόλις ήρθε σε επαφή με την πραγματικότητα της διακυβέρνησης. Δεν άκουσε τις πολλές προειδοποιήσεις, ακόμη και ορισμένων στελεχών του ΣΥΡΙΖΑ, να είναι φειδωλός σε τέτοια παλαιοκομματικά τερτίπια. Συμπεριφέρθηκε με ανευθυνότητα προεκλογικά και στο τέλος του εξαμήνου προσγειώθηκε ανώμαλα, προκαλώντας <strong>μεγάλη ζημιά στην οικονομία</strong>.</p>
<p>- Στο δημοψήφισμα του Ιουλίου συνέβη η μεγαλύτερη<strong> διαστροφή</strong> εκλογικού αποτελέσματος στην πρόσφατη πολιτική ιστορία. Ο κ. Τσίπρας ζήτησε και πήρε ένα ηχηρό ΟΧΙ (στη λιτότητα κτλ) και εν μια νυκτί το έκανε ΝΑΙ, υπογράφοντας μια συμφωνία, την οποία θα μπορούσε να έχει υπογράψει από τις 20 Φεβρουαρίου, αποφεύγοντας τις καταστροφικές συνέπειες του επόμενου πενταμήνου.</p>
<p>Έτσι, στις 13 Ιουλίου,μετά την υπογραφή του δικού του Μνημονίου, ο κ. Τσίπρας βρέθηκε μπροστά σε <strong>πολλαπλά αδιέξοδα.</strong></p>
<p><strong>Έχασε </strong>κάθε ηθικό πλεονέκτημα, που διατηρούσε ως τότε, συμπεριφερόμενος ως πολιτικάντης παλαιάς κοπής.. Έκανε ακριβώς ό,τι έκαναν οι προηγούμενοι, τους οποίους κατακεραύνωνε επί πέντε χρόνια.</p>
<p><strong>Έχασε </strong>την κοινοβουλευτική πλειοψηφία και, χωρίς τη στήριξη της αντιπολίτευσης, την οποία λοιδορεί ξεδιάντροπα, θα είχε οδηγήσει τη χώρα στα βράχια.</p>
<p><strong>Έχασε </strong>το μισό κόμμα του φυσιολογικά, καθώς εμφανίστηκε να το κοροϊδεύει κι αυτό. Έτσι, όσο κι αν προκαλούν σύγκρυο οι θέσεις των αριστεροπλατφορμιστών για επιστροφή στη δραχμή, δεν είναι αυτοί που έκαναν την κωλοτούμπα. Μέχρι χτες έλεγαν όλοι τα ίδια. Ο κ. Τσίπρας είχε υπουργούς τον Λαφαζάνη και τον Στρατούλη και επί πέντε μήνες σερνόταν πίσω από τις παραδοξολογίες τους.</p>
<p>Τώρα ο κ. Τσίπρας θα επιδιώξει να απαλλαγεί από το εσωκομματικό του πρόβλημα με εκλογές-εξπρές. Θα επιδιώξει να <strong>υφαρπάξει</strong>, για τρίτη φορά μέσα σε εφτά μήνες, την ψήφο των πολιτών, χωρίς να ξέρουμε τι θέλει να κάνει. Από τη μια έχει αρχίσει να ψηφίζει τα προαπαιτούμενα του νέου <strong>Μνημονίου</strong> με αντιδημοκρατικές και αντικοινοβουλευτικές μεθόδους, που άλλοτε κατακεραύνωνε ο ίδιος. Και από την άλλη <strong>κοκορεύεται</strong> με διάφορες αστείες ανακοινώσεις (<a href="http://news.in.gr/greece/article/?aid=1500019459" target="_blank">εδώ</a> και <a href="http://www.kathimerini.gr/827683/article/oikonomia/ellhnikh-oikonomia/an-h-fraport-8elei-epanadiapragmateysh-8a-einai-synolikh" target="_blank">εδώ</a>), μπας και συγκρατήσει το τμήμα εκείνο του αριστερού εκλογικού σώματος που τώρα θα <strong>λακίσει</strong> και μπορεί να του στερήσει την εξουσία.</p>
<p>Ο κ. Τσίπρας είναι ένας αδύναμος πρωθυπουργός, που δεν ξέρει τι θέλει και γι&rsquo; αυτό οδηγείται από αδιέξοδο σε αδιέξοδο. Για την ακρίβεια, το μόνο που θέλει είναι να υφαρπάξει ξανά τη λαϊκή ψήφο, πριν αρχίσουν να φαίνονται τα ολέθρια αποτελέσματα της εξάμηνης δικής του πολιτικής. Η <strong>εξουσιολαγνεία</strong>, η δική του και της ομάδας που τον περιβάλλει, είναι ορατή δια γυμνού οφθαλμού.</p>
<p>Οι εκλογές θα είχαν κάποιο νόημα αν ο κ. Τσίπρας έλεγε καθαρά <strong>τι θέλει να κάνει</strong>. Να εφαρμόσει το Μνημόνιό του ή να σταματήσει τις εργασίες στις Σκουριές και να ακυρώσει την ιδιωτικοποίηση των περιφερειακών αεροδρομίων, που η κυβέρνησή του ψήφισε; Με ποιους θα συγκυβερνήσει αν το εκλογικό σώμα συνεχίσει να θέλει κυβερνήσεις συνεργασίας; Τα ερωτήματα είναι κρίσιμα, για να προσπαθήσουμε να συλλάβουμε πώς θα κινηθεί η χώρα τα επόμενα χρόνια.</p>
<p>Ο κ. Τσίπρας μέχρι τώρα έστησε δύο <strong>φάκες</strong>: στις 25 Ιανουαρίου και στις 5 Ιουλίου. Και στις δύο ένα μεγάλο μέρος του εκλογικού σώματος τσίμπησε και παγιδεύτηκε: συνειδητά, από άγνοια ή από αφέλεια. <strong>Η τρίτη παγίδα </strong>είναι αυτή που θα στήσει τώρα με τις νέες εκλογές-εξπρές. Ας έχει κατά νου αυτήν την προειδοποίηση της Γραφής: <strong>&laquo;Όστις σκάπτει λάκκον θέλει πέσει εις αυτόν και ο λίθος θέλει επιστρέψει εις τον κυλίοντα αυτόν&raquo;.</strong></p>
>>>>>>> origin/master
<p>Αν και το ζητούμενο είναι ο λίθος να μην καταπλακώσει τη χώρα και όλους μας.</p>');